MyHomeDev/src/DataProcessors/мх_ЗагрузкаБанковскихВыписок/мх_ЗагрузкаБанковскихВыписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>мх_ЗагрузкаБанковскихВыписок</name>
  <attributes>
    <name>ФайлДляЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.мх_ВариантыЗагрузкиБанковскихВыписок</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьСоответствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеВыписки</name>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МСС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДляСозданияДокументов</name>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.мх_КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходовРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.мх_СтатьиДоходов</types>
        <types>ChartOfCharacteristicTypesRef.мх_СтатьиРасходов</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <type>
        <types>Characteristic.мх_СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.мх_СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КошелекКор</name>
      <type>
        <types>CatalogRef.мх_КошелькиИСчета</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.мх_РегистрацияДоходов</types>
        <types>DocumentRef.мх_РегистрацияРасходов</types>
        <types>DocumentRef.мх_ПеремещениеДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

MyHomeDev/src/Enums/мх_ВариантыЗагрузкиБанковскихВыписок/мх_ВариантыЗагрузкиБанковскихВыписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мх_ВариантыЗагрузкиБанковскихВыписок</name>
  <enumValues>
    <name>Тинькофф</name>
  </enumValues>
  <enumValues>
    <name>Сбербанк</name>
  </enumValues>
</mdclass:Enum>

MyHomeDev/src/DataProcessors/мх_ЗагрузкаБанковскихВыписок/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Читает файл выписки в таблицу значений
// 
// Параметры:
// 	ПараметрыЧтения - Структура:
// 	 * ВариантЗагрузки - ПеречислениеСсылка.мх_ВариантыЗагрузкиБанковскихВыписок - Вариант загрузки выписки
// 	 * АдресХранилищаФайла - Строка - Адрес файла выписки во временном хранилище
// 	 * ПараметрыФайла - Структура - Параметры файла выписки
// Возвращаемое значение:
//  - ТаблицаЗначений - Прочитанные данные 	
Функция ПрочитатьДанныеФайла(ПараметрыЧтения) Экспорт

	ВариантЗагрузки = ПараметрыЧтения.ВариантЗагрузки;

	Если ВариантЗагрузки = ПредопределенноеЗначение("Перечисление.мх_ВариантыЗагрузкиБанковскихВыписок.Тинькофф") Тогда
		ТаблицаДанныхФайла = ПрочитатьДанныеФайлаВыпискиВТаблицуЗначений(ПараметрыЧтения);
		ТаблицаДанных = ЗаполнитьТаблицуДанныхПоДаннымФайлаТинькофф(ТаблицаДанныхФайла);
	ИначеЕсли ВариантЗагрузки = ПредопределенноеЗначение("Перечисление.мх_ВариантыЗагрузкиБанковскихВыписок.Сбербанк") Тогда
		ТаблицаДанныхФайла = ПрочитатьДанныеФайлаВыпискиВТаблицуЗначений(ПараметрыЧтения);
		ТаблицаДанных = ЗаполнитьТаблицуДанныхПоДаннымФайлаСбербанк(ТаблицаДанныхФайла);
	Иначе
		ВызватьИсключение "Неизвестный вариант выписки";
	КонецЕсли;

	Возврат ТаблицаДанных;

КонецФункции

// Читает файл выписки в таблицу значений
// 
// Параметры:
// 	ПараметрыЧтения - Структура:
// 	 * ВариантЗагрузки - ПеречислениеСсылка.мх_ВариантыЗагрузкиБанковскихВыписок - Вариант загрузки выписки
// 	 * АдресХранилищаФайла - Строка - Адрес файла выписки во временном хранилище
// 	 * ПараметрыФайла - Структура - Параметры файла выписки
// Возвращаемое значение:
//  - ТаблицаЗначений - Прочитанные данные 	
Функция ПрочитатьДанныеФайлаВыпискиВТаблицуЗначений(ПараметрыЧтения)

	ВременныйФайл = ПолучитьИмяВременногоФайла(ПараметрыЧтения.ПараметрыФайла.Расширение);

	ДанныеФайла = ПолучитьИзВременногоХранилища(ПараметрыЧтения.АдресХранилищаФайла);
	ДанныеФайла.Записать(ВременныйФайл);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВременныйФайл, СпособЧтенияЗначенийТабличногоДокумента.Значение);

	ОбластьЯчеек = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);

	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);

	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();

	ТаблицаДанных = ПостроительОтчета.Результат.Выгрузить();

	Возврат ТаблицаДанных;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьТаблицуДанныхПоДаннымФайлаТинькофф(ТаблицаФайла)

	Обработка = Обработки.мх_ЗагрузкаБанковскихВыписок.Создать();
	ТаблицаДанных = Обработка.ДанныеВыписки.Выгрузить();

	Для Каждого СтрокаДанных Из ТаблицаФайла Цикл

		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);

		НоваяСтрока.ИдентификаторКарты = СтрокаДанных.НомерКарты;
		НоваяСтрока.МСС = СтрокаДанных.MCC;

	КонецЦикла;

	Возврат ТаблицаДанных;

КонецФункции

Функция ЗаполнитьТаблицуДанныхПоДаннымФайлаСбербанк(ТаблицаФайла)

	Обработка = Обработки.мх_ЗагрузкаБанковскихВыписок.Создать();
	ТаблицаДанных = Обработка.ДанныеВыписки.Выгрузить();

	Для Каждого СтрокаДанных Из ТаблицаФайла Цикл

		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);

		НоваяСтрока.ИдентификаторКарты	 = СтрокаДанных.НомерКарты;
		НоваяСтрока.МСС					 = СтрокаДанных.ТипОперации;
		НоваяСтрока.ДатаОперации		 = СтрокаДанных.ДатаСовершенияОперации;
		НоваяСтрока.СуммаПлатежа		 = СтрокаДанных.СуммаВВалютеСчета;

	КонецЦикла;

	Возврат ТаблицаДанных;

КонецФункции

#КонецОбласти
